307/app/controllers/cart_controller.rb

INSERT INTO "credit_cards" ("card_type", "created_at", "expiration_month", "expiration_year", "number", "updated_at", "verification_number") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def update_credit_card
  @credit_card = CreditCard.new
  @credit_card.card_type           = params[:card_type]
  @credit_card.number              = params[:number]
  @credit_card.verification_number = params[:verification_number]
  @credit_card.expiration_month    = params[:expiration_month]
  @credit_card.expiration_year     = params[:expiration_year]

  if @credit_card.save