309/app/controllers/car_controller.rb

	def submit_login
		@user = CarShareMember.where(username: params["username"]).first
---
SELECT "car_share_members".* FROM "car_share_members" WHERE "car_share_members"."username" = 'Jen' LIMIT 1

  def current_reservation
  	if session[:car_share_member_id] != nil
  		@user = CarShareMember.where(id: session[:car_share_member_id]).first
    	@car = Car.where(car_share_member_id: @user.id).first
---
SELECT "car_share_members".* FROM "car_share_members" WHERE "car_share_members"."id" = 1 LIMIT 1
SELECT "cars".* FROM "cars" WHERE "cars"."car_share_member_id" = 1 LIMIT 1